## Plan Result (1112: stg_aria - Terraform Plan Apply)




<pre><code>Plan: 1 to add, 30 to change, 0 to destroy.</code></pre>

* Create
  * local_file.config[&#34;00&#34;]
* Update
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-bl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-joh-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-td-pub&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-active-ccd&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_storage_account.xcutting[&#34;00&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_storage_account_sas.xcutting["00"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account_sas" "xcutting" {
      + connection_string = (sensitive value)
      + expiry            = "2027-12-31T23:59:59Z"
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = "2024-01-01T00:00:00Z"

      + permissions {
          + add     = true
          + create  = true
          + delete  = true
          + filter  = false
          + list    = true
          + process = true
          + read    = true
          + tag     = true
          + update  = true
          + write   = true
        }

      + resource_types {
          + container = true
          + object    = true
          + service   = true
        }

      + services {
          + blob  = true
          + file  = true
          + queue = true
          + table = true
        }
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfpa-ack-00-uks-dlrm-01"
        name                = "evh-aplfpa-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfpa-dl-00-uks-dlrm-01"
        name                = "evh-aplfpa-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfpa-pub-00-uks-dlrm-01"
        name                = "evh-aplfpa-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-aplfta-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfta-ack-00-uks-dlrm-01"
        name                = "evh-aplfta-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-aplfta-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfta-dl-00-uks-dlrm-01"
        name                = "evh-aplfta-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-aplfta-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-aplfta-pub-00-uks-dlrm-01"
        name                = "evh-aplfta-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-apluta-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-apluta-ack-00-uks-dlrm-01"
        name                = "evh-apluta-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-apluta-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-apluta-dl-00-uks-dlrm-01"
        name                = "evh-apluta-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-apluta-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-apluta-pub-00-uks-dlrm-01"
        name                = "evh-apluta-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-bl-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-bl-ack-00-uks-dlrm-01"
        name                = "evh-bl-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-bl-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-bl-dl-00-uks-dlrm-01"
        name                = "evh-bl-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-bl-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-bl-pub-00-uks-dlrm-01"
        name                = "evh-bl-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-joh-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-joh-ack-00-uks-dlrm-01"
        name                = "evh-joh-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-joh-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-joh-dl-00-uks-dlrm-01"
        name                = "evh-joh-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-joh-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-joh-pub-00-uks-dlrm-01"
        name                = "evh-joh-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-sbl-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-sbl-ack-00-uks-dlrm-01"
        name                = "evh-sbl-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-sbl-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-sbl-dl-00-uks-dlrm-01"
        name                = "evh-sbl-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-sbl-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-sbl-pub-00-uks-dlrm-01"
        name                = "evh-sbl-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-td-ack"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-td-ack-00-uks-dlrm-01"
        name                = "evh-td-ack-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-td-dl"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-td-dl-00-uks-dlrm-01"
        name                = "evh-td-dl-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_eventhub.aria_topic["00-td-pub"] will be updated in-place
  ~ resource "azurerm_eventhub" "aria_topic" {
        id                  = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-stg/eventhubs/evh-td-pub-00-uks-dlrm-01"
        name                = "evh-td-pub-00-uks-dlrm-01"
      ~ partition_count     = 8 -> 16
        # (6 unchanged attributes hidden)
    }

  # azurerm_linux_function_app.example["00-af-active-ccd"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-active-ccd-stg00-uks-dlrm-01"
        name                                           = "af-active-ccd-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfpa-stg00-uks-dlrm-01"
        name                                           = "af-aplfpa-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-aplfta-stg00-uks-dlrm-01"
        name                                           = "af-aplfta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-apluta-stg00-uks-dlrm-01"
        name                                           = "af-apluta-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-bails-stg00-uks-dlrm-01"
        name                                           = "af-bails-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-joh-stg00-uks-dlrm-01"
        name                                           = "af-joh-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-sbails-stg00-uks-dlrm-01"
        name                                           = "af-sbails-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_linux_function_app.example["00-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
          + "AzureWebJobsStorage"                                   = (sensitive value)
          + "FUNCTIONS_EXTENSION_VERSION"                           = "~4"
          - "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                   = "true" -> null
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                       = "true" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"                              = "0" -> "1"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Web/sites/af-td-stg00-uks-dlrm-01"
        name                                           = "af-td-stg00-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.xcutting["00"] will be updated in-place
  ~ resource "azurerm_storage_account" "xcutting" {
        id                                 = "/subscriptions/da8a21e5-d260-4162-9391-6bdadf9103f8/resourceGroups/ingest00-main-stg/providers/Microsoft.Storage/storageAccounts/ingest00xcuttingstg"
        name                               = "ingest00xcuttingstg"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest" -> null
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra" -> null
          - "businessArea" = "cross-cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = (known after apply)
          + default_action = "Allow"
          + ip_rules       = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "stg"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_stg_00.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 30 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 1112: stg_aria - Terraform Plan Apply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-aria/issues/197/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":197,"Program":"tfcmt","SHA1":"","Target":"1112: stg_aria - Terraform Plan Apply","Vars":{}} -->